In [1]:
import pandas as pd

In [4]:
data = {'data' : [4,8,15,16,23,42]}

In [5]:
df = pd.DataFrame(data)

In [6]:
df

   data
0     4
1     8
2    15
3    16
4    23
5    42

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [7]:
my_list = [i for i in range(1,11)]

In [8]:
my_series = pd.Series(my_list)

In [9]:
my_series

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

Q3. Create a Pandas DataFrame that contains the following data:

In [2]:
data = {'Name' : ['Alice','Bob','Claire'],'Age' : [25,30,27],'Gender' : ['Female','Male','Female'] }

In [15]:
df2 = pd.DataFrame(data)

In [16]:
df2

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

ANSER: In Pandas, a DataFrame is a 2-dimensional labeled data structure with columns of potentially different types. It is the most commonly used Pandas object and can be thought of as a table, spreadsheet or a SQL table. It has both row and column labels, and it allows us to store and manipulate data in an easy and efficient way.

On the other hand, a Pandas Series is a one-dimensional labeled array that can hold data of any type. It is similar to a column in a spreadsheet or a SQL table. Each element in a Series has a label called an index, which can be used to access the element.

The main difference between a DataFrame and a Series is that a DataFrame can store multiple columns of data, whereas a Series can store only a single column of data.

Here's an example to illustrate the difference between a DataFrame and a Series:

In [18]:
#Creating a panda seies object
m_series = pd.Series([1,2,3,4,5])
m_series

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [19]:
#creating a pandaas dataframe object
data = {'Name' : ['Alice','Bob','Claire'],'Age' : [25,30,27],'Gender' : ['Female','Male','Female'] }
dff = pd.DataFrame(data)

In [20]:
print(dff)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

ANSWER : drop(): This function is used to remove a column or row from a DataFrame.

fillna(): This function is used to fill in missing values in a DataFrame with a specified value or method, such as the mean or median.

groupby(): This function is used to group the data in a DataFrame by one or more columns and perform aggregate functions on each group.

In [22]:
#using groupby function with mean 

customer_data = pd.DataFrame({
    'Gender': ['M', 'F', 'F', 'M', 'M'],
    'Age': [25, 30, 35, 40, 45],
    'Purchases': [100, 200, 150, 300, 250]
})

# Group the customers by gender and calculate the average purchases
gender_grouped = customer_data.groupby('Gender')['Purchases'].mean()

# Print the results
print(gender_grouped)

Gender
F    175.000000
M    216.666667
Name: Purchases, dtype: float64

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Both Series and DataFrame are mutable in nature, while Panel is considered deprecated in pandas version 0.25.0 and later, and it is recommended to use MultiIndex objects to represent higher-dimensional data instead.

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [34]:
name = pd.Series(["Shadab","Raj","Sam"],name = "Name")
roll_no = pd.Series([101,103,125],name = "Roll_no")
fees = pd.Series([90000,85000,125000],name = "fee")

df3 = pd.concat([name,roll_no,fees],axis = 1)
print(df3)

     Name  Roll_no     fee
0  Shadab      101   90000
1     Raj      103   85000
2     Sam      125  125000

NOTE : axis=1 to specify merge series as columns instead of rows, using axis=0 appends series to rows instead of columns.

In this example, we first create three separate Series objects called "name", "roll_no", and "fees" that contain some data. We then pass these Series objects to the DataFrame constructor as a dictionary, with the keys being the column names and the values being the Series objects. Finally, we assign the resulting DataFrame to the variable "df" and display it using the "print" function. The resulting DataFrame has three columns called  "Name", "Roll_no", and "Fees", and four rows of data.